<script setup>
import { onMounted, ref } from 'vue';
import { useRoute } from 'vue-router';


const products = [
  { id: 0, title: 'ПРОФЛИСТ', imageUrl: '/profnastil.jpg', body: `Профлист — облицовочный стеновой или кровельный строительный материал,
        предназначенный для возведения наружных ограждений, 
        стен и крыш; а также — для монолитных железобетонных перекрытий 
        «по профнастилу». Представляет собой металлический лист,
        изготавливаемый из листовой оцинкованной стали методом 
        холодного проката. При изготовлении подвергается профилированию 
        (приданию волнообразной, трапециевидной и т. п. формы), т.е. на 
        листе искусственно создаются рёбра для повышения жёсткости. 
        Благодаря красивому эстетичному виду, техническим характеристикам 
        и цене профлист стал одним из самых популярных и востребованных 
        строительных материалов на рынке.

        Сфера применения материала определяет его вид. 
        Профлисты различаются по форме профиля и его высоте. 
        Например, профнастил для стен применяется для облицовки 
        стен строений и создания ограждения. Его маркируют буквой "С".

        Изделия, имеющие более высокую «волну» и 
        сложный рисунок профиля, относятся к маркам «Н» и «НС». 
        Чем выше и сложнее по форме ребро жёсткости, образованное 
        «волнами» профиля, тем большую нагрузку профлист способен выдержать. 
        Высота профиля в маркировке обозначается цифрами, указывающими высоту 
        «волны» в миллиметрах.` },


  { id: 1, title: 'СЭНДВИЧ ПАНЕЛИ', imageUrl: '/paneli.webp', body: `Сэндвич-панели – это строительный материал,
   имеющий трёхслойную структуру, состоящую из двух листов металла и слоя утеплителя между ними. 
   При использовании в строительстве сэндвич-панели можно сократить сроки возведения или ремонта 
   объекта недвижимости. Сэндвич-панели получили широкое распространение в России за счет того, 
   что они легко переносят значительные перепады температур. Более того, панели не пропускают 
   влагу и позволяют надежно удерживать тепло в жилище. Из сэндвич-панелей возводят красивые 
   жилые коттеджи, административные корпуса, производственные и развлекательные комплексы. 
   Кроме того, сэндвич-панели, цена которых доступна потребителю, могут играть роль утеплителя 
   и шумоизолирующего элемента.

  Различают два вида сэндвич-панелей по функциональному назначению: 
  стеновые и кровельные, особенностью которых являются особые системы
  замков и жесткость. ` },


  { id: 2, title: 'РУЛОННАЯ СТАЛЬ И ШТРИПС', imageUrl: '/stal.jpg', body: `Рулонная и листовая сталь, 
  относящиеся к изделиям плоского проката, используются необычайно широко: от производства 
  крупной и мелкой бытовой техники и водосточных систем до возведения сельскохозяйственных 
  построек и транспортного машиностроения. Они могут иметь как двустороннее, так и одностороннее 
  цинковое покрытие, в том числе и полимерное покрытие. В качестве исходного сырья для производства 
  профильного листа, металлочерепицы и доборных элементов используется стальной лист в рулоне с 
  полимерным покрытием. 

  Технология нанесения полимерного покрытия заключается в химической подготовке полосы, 
  нанесении краски на полосу при помощи валков, термообработке полосы для полимеризации 
  (закрепления) краски. Задача заключается в равномерном нанесении покрытия в течение короткого 
  процесса, получении однородной поверхности и требуемой толщины покрытия. Защитно-декоративное 
  покрытие усиливает антикоррозийные свойства металла.

  Гладкий лист чаще всего применяют для изготовления доборных элементов 
  кровли и систем водостоков, также возможно использование в качестве сырья 
  для изготовления отливов или воздуховодов вентиляции. Гладкий лист с полимерным 
  покрытием поставляется в рулонах массой от 3 до 10т. Данный материал выдерживает 
  значительные механические нагрузки, в том числе штамповку, гибку, вытяжку и вальцовку. 
  Именно рулонная сталь служит основой для изготовления оцинкованного профнастила — востребованного 
  строительного материала.             

  ГЛАДКИЙ ЛИСТ
  СТАЛЬ В РУЛОНАХ ОЦИНКОВАННАЯ  
  СТАЛЬ В РУЛОНАХ С ПОЛИМЕРНЫМ ПОКРЫТИЕМ` },


  { id: 3, title: 'ТРУБНЫЙ ПРОКАТ', imageUrl: '/trubn.jpg', body: `Прокат, представляет собой 
  металлопродукцию металлургии, которая производится при помощи прокатных станов. 
  Производство выполняется двумя видами проката:
  высокотемпературный прокат (горячий прокат);
  холодный прокат.
  Достаточно популярным видом сортамента (особенно в строительной и машиностроительной промышленности) 
  является трубный металлопрокат. Производство трубного проката выполняется при помощи трубопрокатного 
  оборудования, при обработке специальных заготовок (круглые, плоские). Трубопрокат характеризуется большим 
  разнообразием готовых изделий, которые предназначены для применения в различных сферах.

  Трубный прокат – изготовляется способом пластической обработки. В ее основе лежит 
  применение валков высокотехнологичного прокатного оборудования, между которыми 
  пропускается металл.

  По способу изготовления трубы делятся:
  бесшовные горячедеформированные;
  бесшовные холоднодеформированные;
  профильные прямоугольные;
  профильные квадратные;
  водогазопроводные (ВГП);
  электросварные.` },


  { id: 4, title: 'СОРТОВОЙ ПРОКАТ', imageUrl: '/sortovoi.jpg', body: `В машиностроении, строительстве, 
  на транспорте широко применяется металлический прокат: листы, полосы, ленты, рельсы, балки и т. д. 
  Его получают в результате обжатия слитка металла в горячем или холодном состоянии между вращающимися 
  валками прокатного стана. Таким образом обрабатывают сталь, цветные металлы и их сплавы.

  Различают следующие профили сортового проката: простые (круг, квадрат, шестиугольник, полоса, лист), 
  фасонные (рельс, балка, швеллер, тавр и др.), специальные (колеса, арматурная сталь и др.).

  Сортовой прокат — один из видов полуфабрикатов. Так называют продукт труда, 
  предназначенный для дальнейшей обработки и получения готовых изделий.

  Стандартные профили сортового проката:

  Арматура (используется при построении железобетонных конструкций);
  Круг (используется при производстве крепежей в виде болтов, гаек, заклепок и т.д.);
  Квадрат (подходит к разнообразным  конструкциям, начиная от металлоконструкции и завершая выстраиванием сложнейших скамеек, сеток и оград);
  Шестигранник (схож с квадратом, но в общих чертах его также используют в изготовлении крепежей, фрагментов разных механизмов и различной продукции, заготовок и т.д.);
  Полоса (используется при изготовлении конструкций из металла, гнутых профилей, режущего инструмента и как особый вид элемента декора).` },


  { id: 5, title: 'ФАСОННЫЙ ПРОКАТ', imageUrl: '/fasonniy.jpg', body: `Фасонный прокат представляет 
  собой вид металлических изделий, которые изготавливаются из горячекатаного или холоднокатаного металла 
  в виде профилей различных сечений. Он обладает высокой прочностью и жесткостью, что делает его идеальным 
  для использования в строительстве и машиностроении. Фасонный прокат применяется в самых различных областях — 
  от создания каркасных конструкций и высотных зданий до производства легких и тяжелых металлоконструкций.

Основные виды фасонного проката включают уголки, швеллеры, двутавры, балки и другие профили, 
которые могут быть как равнополочными, так и неравнополочными. Эти изделия используются для создания 
несущих элементов конструкций, обеспечивая их надежность и долговечность.

Процесс производства фасонного проката включает горячую деформацию, что позволяет получать 
профили сложной формы. Эти изделия могут иметь как гладкую, так и рифленую поверхность, что 
позволяет улучшить сцепление с другими материалами. Фасонный прокат часто подвергается дополнительной 
обработке, включая антикоррозийные покрытия, чтобы повысить его устойчивость к негативным воздействиям 
окружающей среды.

Фасонный прокат также используется в производстве различных строительных элементов, 
таких как колонны, балки, каркасы и поддержку для крыш. Он обеспечивает гибкость 
проектирования и быстрое создание конструкций, а также позволяет сократить время 
на их монтаж. Благодаря высоким механическим характеристикам и долговечности, фасонный 
прокат стал незаменимым материалом в строительной отрасли, особенно в условиях российских 
климатических условий, где необходимы прочные и надежные конструкции.` },


  { id: 6, title: 'МЕТАЛЛОЧЕРПИЦА', imageUrl: '/cherepica.webp', body: `Металлочерепица - это кровельный материал с имитацией 
  классической черепицы, изготовленный из оцинкованной стали с лакокрасочным покрытием. 
  Металлочерепица является на сегодняшний день, пожалуй, самым популярным материалом среди 
  строителей-профессионалов и частных застройщиков. Данный материал применяют как при строительстве 
  частных домов, так и при возведении многоэтажных жилых и общественных зданий.

  Металлочерепица является практически универсальным вариантом, подходящим для скатных
  крыш разного типа. Использовать металлочерепицу можно для кровельных работ в любой 
  климатической зоне, она хорошо переносит высокие и низкие температуры.

  К положительным свойствам этого кровельного материала относятся:
  простота укладки;
  обширная цветовая гамма;
  долговечность службы;
  стоимость;
  небольшой вес;
  стойкость к воздействию атмосферных осадков (благодаря гладкой ровной поверхности материала, вода и снег легко сходят).
  КАСКАД,
  СУПЕР МОНТЕРРЕЙ` },


  { id: 7, title: 'МЕТАЛЛОСАЙДИНГ', imageUrl: '/saiding.jpg', body: `Металлосайдинг (металлический сайдинг) - строительный материал, 
  изготавливаемый на основе металлических оцинкованных листов, дополнительно также наносится защитно-декоративный 
  полимерный слой. Изготовление металлосайдинга происходит методом холодного проката. Металл проходит через валы 
  специального прокатного станка, которые придают ему требуемую форму.

  Металлический сайдинг выполняет такие функции, как:
  защита наружных перекрытий;
  придание эстетического вида фасадам;
  маскировка различных неровностей, дефектов и систем коммуникаций.
  Сайдинг стальной изготавливается длиной до 6 метров при любой кратности реза. Панели изготавливаются в защитной пленке.          

  БЛОК ХАУС,
  ЕВРОБРУС,
  КОРАБЕЛЬНАЯ ДОСКА` },
  { id: 8, title: 'ДОБОРНЫЕ ЭЛЕМЕНТЫ', imageUrl: '/dobornie-el.webp', body: `Доборные элементы - изделия, 
  без которых монтаж металлочерепицы, профнастила и сайдинговых панелей был бы невозможен. 
  Изготовленные из оцинкованной стали, эти изделия незаменимы как при проведении кровельных работ, 
  так и при строительстве в целом. 

  Доборные элементы  играют роль защиты, 
  она заключается в ограничении доступа воды и пыли в помещение.

  Кроме функциональных элементов (конек крыши, ендовы и уголки, водосточные желоба, снегозадержатели, примыкания), 
  к числу доборных частей можно отнести различные украшения для кровли. К ним относятся шпили, флюгеры и другие 
  декоративные детали. Они не несут никакой практической нагрузки, а просто помогают придать дому индивидуальность и стиль.

  КОНЁК ПРОСТОЙ,
  ЕНДОВА,
  КАРНИЗНАЯ ПЛАНКА,
  ПЛАНКА ЗАБОРНАЯ,
  ВЕТРОВАЯ ПЛАНКА,
  ЗАГЛУШКА КОНЬКА ПОЛУКРУГЛОГО,
  КОЛПАК НА СТОЛБ,
  ОТЛИВ ОКОННЫЙ,        
  САМОРЕЗЫ ДЛЯ СЭНДВИЧ-ПАНЕЛЕЙ,
  САМОРЕЗЫ КРОВЕЛЬНЫЕ` },
  { id: 9, title: 'ВОДОСТОЧНЫЕ СИСТЕМЫ', imageUrl: '/vod-system.jpeg', body: `Водосточная система — это совокупность 
  различных элементов, которые устанавливаются согласно определенной последовательности на кровле и фасаде здания. 
  Оцинкованная сталь, на которую нанесен слой полимера – это главный материал, из которого изготавливаются металлические 
  водосточные системы. Повышенная прочность – это главное достоинство таких систем.

  Прежде всего, водостоки несут защитную функцию — они оберегают стены, 
  окна и цоколь фундамента дома от попадания дождевой воды и снега в период 
  непогоды. Вторая функция водосточных систем — декоративная. Они незаменимы 
  и завершают кровельные работы, отделку оконных проёмов или благоустройство забора. 
  Водостоки должны подчеркивать уникальность дизайна дома, гармонично сочетаясь с материалом, 
  из которого сделана крыша, равно как и с другими элементами здания, такими как окна, наличники, 
  оконные решетки, отливы.

  ЖЕЛОБ ПОЛУКРУГЛЫЙ,
  ЗАГЛУШКА ЖЕЛОБА,
  ВОРОНКА,
  КОЛЕНО СЛИВНОЕ,
  ТРУБА ВОДОСТОЧНАЯ,
  КРОНШТЕЙН ЖЕЛОБА,
  КРОНШТЕЙН КРЕПЛЕНИЯ,
  УГОЛ ЖЕЛОБА,` },
  { id: 10, title: 'ИЗОЛЯЦИОННЫЕ МАТЕРИАЛЫ', imageUrl: '/izolation.jpg', body: `Одним из удачных решений для изоляции 
  строительных объектов являются материалы Rockwool, специально разработанные для эксплуатации 
  в тяжелых климатических условиях. «Rockwool» - это комплекс профессиональных высококачественных
  рулонных изоляционных материалов

  Данные материалы применяются для проветриваемых наклонных крыш и стен. 
  Благодаря микроперфорации обеспечивается не только гидроизоляция объекта, 
  но и предоставляется возможность вентиляции внутренних помещений путем вывода 
  наружу водяных паров. Кроме того, их можно использовать в процессе строительных 
  работ для защиты открытых кровельных конструкций и утеплителя от атмосферных осадков.        

  Технониколь
  Rockwool
  Izovol` },
  { id: 11, title: 'КРЕПЁЖ', imageUrl: '/krepesh.jpg', body: `Крепеж представляет собой разнообразные металлические изделия, 
  предназначенные для соединения, крепления или удерживания различных конструкций, узлов и деталей в различных областях 
  применения, включая строительство, машиностроение и бытовую сферу. Крепежные элементы обеспечивают надежное и долговечное 
  соединение, что является критически важным для устойчивости и безопасности конструкций.

  Среди основных видов крепежа можно выделить болты, гайки, шайбы, винты, анкеры, саморезы, римские и закладные элементы. 
  Каждый тип крепежа выполняет свою уникальную функцию и используется в зависимости от условий эксплуатации и вида 
  соединяемых материалов. Например, болты и гайки часто применяются для соединения металлических конструкций, в то время 
  как саморезы лучше подходят для работы с древесиной и пластиком.

  Процесс производства крепежа включает холодное или горячее формование, закалку для повышения прочности, 
  а также покрытие защитными материалами, такими как цинковое или полимерное покрытие, что увеличивает коррозионную 
  стойкость и долговечность крепежных элементов. Современные методы обработки и нанесения покрытий позволяют достичь
  высокой точности и качества крепежа, что особенно важно в условиях серьезных нагрузок и вибраций.

  Крепежные элементы находят широкое применение в строительстве, где используются в качестве соединительных 
  элементов для конструкций, стен, крыш и различных систем. Наличие большого ассортимента крепежа позволяет 
  обеспечить надежное выполнение любых строительных задач — от монтажа легких перегородок до установки сложных 
  металлических конструкций.

  Эти изделия также используют в производстве бытовой техники, мебели и автомобильной промышленности, 
  обеспечивая надежное соединение различных компонентов. Рынок крепежа предлагает разнообразные решения, 
  которые позволяют выбрать оптимальный вариант для конкретной задачи, тем самым обеспечивая безопасность 
  и долговечность конструкции в целом.` },
];

const route = useRoute(); // Получение маршрута

const product = ref(null); // Объект продукта, который будет найден

onMounted(() => {
  const productId = Number(route.params.id); // Получение id из параметров маршрута
  product.value = products.find(p => p.id === productId); // Поиск продукта по id
});
</script>

<template>
  <div class="container mx-auto mt-24 p-6">
    <div v-if="product" class="bg-gray-200 rounded-lg shadow-lg p-6 max-w-6xl mx-auto">
      <h1 class="text-3xl font-bold text-center text-gray-800 mb-4">{{ product.title }}</h1>
      <img :src="product.imageUrl" alt="Продукт" class="w-full h-64 opacity-90 object-cover rounded-md mb-4" />
      <p class="text-gray-600 text-base leading-relaxed">
        {{ product.body }}
      </p>
    </div>
    <div v-else class="text-center mt-12">
      <p class="text-xl text-red-600">Продукт не найден.</p>
    </div>
  </div>
</template>

<style scoped>
/* Добавьте дополнительные стили по необходимостям */
</style>
