<template>
  <div class="max-w-4xl mx-auto p-6 rounded-lg ">
    <h1 class="text-3xl font-bold text-center text-gray-800 mb-8">Производство</h1>

    <section class="space-y-8">
      <div class="bg-gray-200 p-5 rounded-lg shadow">
        <img src="/profnastil.jpg" alt="Профнастил" class="w-full rounded-lg mb-4" />
        <p class="text-gray-800">
          Компания ООО «ПК СпектрПрофиль» производит и реализует: профнастил, металлочерепицу, гладкий лист оцинкованный и окрашенный, рулонную сталь, штрипс, водосточную систему, доборные элементы кровли, сортовой прокат.
          <br /><br />
          Профнастил оцинкованный и с полимерным покрытием обладает многими достоинствами: стойкость к любым погодным условиям, небольшой вес, долговечность, простота монтажа, удобство транспортировки, низкие эксплуатационные расходы, эстетичный внешний вид. Изготовление профнастила осуществляется при использовании высококачественной оцинкованной стали и стали с полимерным покрытием.
        </p>
      </div>

      <div class="bg-gray-200 p-5 rounded-lg shadow">
        <h2 class="text-2xl font-semibold text-gray-800 mb-4">Наше оборудование</h2>
        <p class="text-gray-800">
          Наше оборудование позволяет производить профлист, металлочерепицу, лист, штрипс по размеру заказчика. Компания ООО «СпектрПрофиль» работает только на новых станках, геометрия волны ровная, четкие радиусы гибки.
        </p>
      </div>

      <div class="bg-gray-200 p-5 rounded-lg shadow">
        <h2 class="text-2xl font-semibold text-gray-800 mb-4">Компания «ПК СпектрПрофиль» располагает</h2>
        <ul class="list-disc list-inside text-gray-800">
          <li>производственно-складской базой с удобным подъездом;</li>
          <li>высококвалифицированным и доброжелательным персоналом, который поможет Вам сделать правильный выбор, произвести грамотные расчеты;</li>
          <li>собственным автотранспортом, который позволит оперативно осуществить поставку продукции в любое удобное для клиента время и место.</li>
        </ul>
      </div>
    </section>

    
    <div class="bg-gray-200 p-5 rounded-lg shadow mt-10">
      <h2 class="text-3xl font-bold text-gray-800  mb-6">Производство сэндвич-панелей</h2>
      <img src="/paneli.webp" alt="Сэндвич-панели" class="w-full rounded-lg mb-4" />
      <p class="text-gray-800">
        Этот теплоизолирующий высокоэффективный материал, помогающий за короткие сроки возводить огромные сооружения и незначительные по размерам постройки, с недавнего времени пользуется большой популярностью. Сегодня производство сэндвич-панелей достигло очень высокого уровня, поскольку они являются достойной недорогой альтернативой дорогостоящему дереву или кирпичу.
        <br /><br />
        Свое название эти панели получили благодаря известному бутерброду-сэндвичу, состоящему из нескольких слоев. Точно так же из нескольких слоев, обеспечивающих высокую прочность, износостойкость и долговечность, состоят и стеновые, потолочные, кровельные сэндвич-панели и другие их виды.
      </p>
    </div>
  <div class="bg-gray-200 p-5 rounded-lg shadow mt-10">
    <h3 class="text-2xl font-semibold text-gray-800  ">Некоторые нюансы изготовления</h3>
    <p class="text-gray-800 mb-4">

      Многие производители сэндвич-панелей делают все возможное, чтобы уменьшить толщину листа, но при этом сохранить теплоизоляционные свойства. Таким образом, автоматически увеличивается полезная площадь зданий. Метод склеивания, который используется при производстве, позволяет изготавливать различные виды панелей.
      <br /><br />
      Структура панели достаточно простая: теплоизоляционный слой из минеральной ваты, пенополистирола или пенополиизоцианурата, облицованный стальными профилированными листами. Последние могут быть либо окрашенные, либо оцинкованные. Такое несложное изготовление сэндвич-панелей позволяет снижать их стоимость.
      <br /><br />
      Относительно утеплителя, чаще всего применяется пенополистирол, который является трудносгораемым самозатухающим материалом благодаря использованию в нем сырья с антипиренами. В качестве облицовочных слоев могут также применяться алюминиевые листы, фанера, древесноволокнистые трудногорючие плиты, бумажно-слоистый трудногорючий пластик. Если говорить о стеновых и кровельных панелях, можно найти незначительные различия в их изготовлении. Производители сэндвич-панелей обоих типов используют оцинкованную тонколистовую сталь с полимерным покрытием и многослойной отделкой, клей на полиуретановой основе, лабиринтовое замковое соединение и различные утеплители.
    </p>
    </div>
    <div class="bg-gray-200 p-5 rounded-lg shadow mt-10">
      <h3 class="text-2xl font-semibold text-gray-800">Основные способы производства</h3>
      <p class="text-gray-800 mb-4">
        Изготовление этого строительного материала происходит несколькими способами: с помощью автоматических линий (так называемый поточный тип) – производство сэндвич-панелей таким способом экономически выгодно, поскольку временные затраты на их изготовление сокращаются в среднем в 4 раза; вспениванием наполнителя, находящегося между облицовочными листами (подходит только для панелей с пенополиуретановым утеплителем); ручной сборкой (на сэндвич-панели цена поднимается, если данный строительный материал изготавливался таким методом).
        <br /><br />
        Многими крупными строительными компаниями и частными лицами доказано, что изготовление сэндвич-панелей экономически выгодное. Кроме того, они легко крепятся, не требуют больших усилий для установки благодаря малому весу, имеют высокие показатели экологичности, тепло-, звукоизоляции и влагонепроницаемости.
      </p>
    </div>
  </div>
</template>

<script setup>

</script>

<style scoped>
/* Ваши дополнительные стили, если это необходимо */
</style>



  


